--[[
    R剧本中的常量，主要就是些映射关系
--]]

local RPlotConst = {}

RPlotConst.ACTION_MAPPING = {
    ["无"] = -1,
    ["普通"] = 0,
    ["跪着"] = 1,
    ["脸红"] = 2,
    ["举手"] = 3,
    ["哭"] = 4,
    ["伸手"] = 5,
    ["作揖"] = 6,
    ["盘坐脸红"] = 7,
    ["盘坐举手"] = 8,
    ["盘坐哭"] = 9,
    ["倒下"] = 10,
    ["下跪"] = 11,
    ["被缚"] = 12,
    ["单膝跪地"] = 13,
    ["挥剑劈下"] = 14,
    ["挥剑扬起"] = 15,
    ["起身"] = 16,
    ["单手举起"] = 17,
    ["未知"] = 18,
    ["活埋"] = -1, --!! 有问题
}

RPlotConst.DIR_MAPPING = {
    ["朝南"] = "down",
    ["朝北"] = "up",
    ["朝东"] = "right",
    ["朝西"] = "left",
    ["默认方向"] = "up", --!! 不确定
}

RPlotConst.HEAD_MAPPING = {
    [0] = {"曹操", "ccz/head/7.jpg", "普通"},
    [1] = {"曹操", "ccz/head/1.jpg", "惊讶"},
    [2] = {"曹操", "ccz/head/2.jpg", "愤怒"},
    [3] = {"曹操", "ccz/head/3.jpg", "欣喜"},
    [10] = {"夏侯惇", "ccz/head/224.jpg", "蒙目"},
    [11] = {"夏侯惇", "ccz/head/8.jpg", "独目"},
    [20] = {"诸葛亮", "ccz/head/214.jpg", "邪恶"},
    [21] = {"诸葛亮", "ccz/head/42.jpg", "正常"},
    [22] = {"诸葛亮", "ccz/head/42.jpg", "正常"},
    [30] = {"曹丕", "ccz/head/226.jpg", "称帝"},
}

RPlotConst.GAMEWIN_MAPPING = {
    ["曹丕称帝"] = "red",
    ["曹操统一"] = "gold",
    ["魔王孔明"] = "blue",
}

return RPlotConst
