--[[,
    --!! 临时映射一下
--]]

local ArmyMappingInfo = {
    ["远程兵种"] = {
        "弓兵",
        "弓骑兵",
        "炮车",
    },
    ["近战兵种"] = {
        "君主",
        "步兵",
        "骑兵",
        "西凉骑兵",
        "贼兵",
        "武道家",
        "舞娘",
        "训熊师",
        "训虎师",
        "黄巾军",
        "木人",
        "土偶",
        "海盗",
    },
    ["攻击型文官"] = {
        "策士",
        "骑马策士",
        "道士",
        "咒术士",
        "都督",
        "仙人",
    },
    ["可显示兵种"] = { -- 这是明面上显示的兵种分类，例如在装备适配时显示
        "君主",
        "步兵",
        "弓兵",
        "骑兵",
        "弓骑兵",
        "贼兵",
        "炮车",
        "武道家",
        "舞娘",
        "策士",
        "骑马策士",
        "道士",
        "风水士",
    },
}

return ArmyMappingInfo